{"author": null, "casenumber": "Suit 2/1997, RA 600058 & 600062/2000", "casename": "Ang Kong Meng v Lim Teck Boon and Another", "citation": "[2000] SGHC 115", "coram": "Chan Seng Onn JC", "counsel": "Tan Cheng Yew (Tan Cheng Yew & Partners) for the plaintiff; Ronald Choo (Allen & Gledhill) for both defendants", "headings": [{"type": "h_b", "text": "For loss of income, he fixed the directors fee for the plaintiff at $10,000 p.m. and multiplied it by 21.5 months. After deducting 20% for income tax, transport expenses and the plaintiffs mitigation of his loss, he awarded $172,000 for this item.", "para": 4}, {"type": "h_b", "text": "The loss here was assessed on the basis that had the plaintiff not been removed as the chairman and director, the company would have sold the factory premises in Singapore (held on a 30 year lease from 1984 with an option for a further term of 30 years) before the downturn in the property market sometime in late 1997. The assistant registrar assessed this loss to the plaintiff at $50,000 to compensate him for his loss of the chance to sell the factory premises at the market price then prevailing before the property market softened.", "para": 4}, {"type": "h_b", "text": "The plaintiff alleged that he had suffered loss because he was prevented from putting into operation his business plans which would have enabled the company to be more profitable. The assistant registrar disallowed this head of claim.", "para": 4}, {"type": "h_b", "text": "(A) Loss of income as chairman and director of the company", "para": 6}, {"type": "h_b", "text": "(B) Loss of a chance to sell the factory premises before the property downturn in late 1997.", "para": 23}, {"type": "h_b", "text": "(C) Loss in the value of the plaintiffs shareholding because he was not allowed to control and manage the company for 21.5 months", "para": 36}, {"type": "h_b", "text": "Chan Seng Onn", "para": 47}], "decorations": [{}, {}, {}, {}, {}, {}, {}, {}, {}, {}, {}, {}, {}, {}, {}, {"bold": [[253, 264]], "underline": [[253, 264]]}, {"bold": [[625, 632]], "underline": [[625, 632]]}, {}, {"bold": [[708, 715]], "underline": [[708, 715]]}, {}, {}, {}, {}, {}, {}, {}, {}, {}, {}, {}, {"bold": [[598, 608]], "underline": [[598, 608]]}, {}, {"bold": [[1016, 1027]], "underline": [[1016, 1027]]}, {}, {}, {}, {}, {}, {}, {}, {}, {}, {}, {}, {}, {}]}