{"author": "Pang Khang Chau JC:", "casenumber": "High Court — Companies Winding Up No 252 of 2016", "casename": "Prospaq Group Pte Ltd v Yong Xing Construction Pte Ltd", "citation": "[2018] SGHC 27", "coram": "Pang Khang Chau JC", "counsel": "Nicholas Aw and Annsley Wong (Clifford Law LLP) for the plaintiff;Eugene Thuraisingam, Suang Wijaya and Teo Shermin (Eugene Thuraisingam LLP) for the defendant; Dhanwant Singh (S K Kumar Law Practice LLP) for Li AnQuan;Sheryl Ang and Claire Yuen (WongPartnership LLP) for creditor, Stars Engrg Pte Ltd;Chermaine Tan Si Ning (Patrick Ong Law LLC) for creditor, Kurihara Kogyo Co., Ltd;Gopal Perumal (Gopal Perumal & Co) for creditors, Ribar Industries Pte Ltd and Jua Seng Engineering Works Pte Ltd;Peng Yin-Chia (Jusequity Law Corporation) for creditor, Yew Hup Construction Pte Ltd;Vinna Yip (Tan Kok Quan Partnership) for creditor, TSL Transport & Engineering Pte. Ltd.;Favian Kang and Chia Xin Hui (Eldan Law LLP) for creditor, Chin Seng Engineering Pte Ltd;Darren Tan (TSMP Law Corporation) for creditor, JRP & Associates;Christopher Goh (Goh Phai Cheng LLC) for creditors, Greencast Pte. Ltd and Architects Team 3 Pte Ltd;Mark Lam and Beitris Yong (Central Chambers Law Corporation) for creditor, Eltraco Roofing System Pte Ltd; Madeline Yeo and Spring Tan (KhattarWong LLP) for creditor, Pan-United Concrete Pte Ltd;Mirza Namazie and Ong Ai Wern (Mallal & Namazie) for creditors, Lai Yew Seng Pte Ltd, Natural Cool Airconditioning & Engineering Pte Ltd and Innovate Fabrication Pte Ltd;Ho Shao Hsien and Lorenda Lee (Eldan Law LLP) for creditor, ISO-Integrated M&E Pte. Ltd. (formerly known as Rongshun Engineering & Construction Pte Ltd;Raymund Anthony (Gateway Law Corporation) for creditor, Hock Seng Hoe Metal Pte Ltd;Shu Shin Yee (Malkin & Maxwell LLP) for creditor, Air-related services Pte Ltd;Justin Phua (Justin Phua Tan & Partners) for creditor, Asia Mortar Pte Ltd;Wong Tian Ying (Fortis Law Corporation) for creditor, Normet Singapore Pte Ltd;Timothy Ong (Timothy Ong & Partners) for creditor, SinMetal Engineering Pte Ltd;Elvis Lim and Juliet Chee (in persons) for creditor, Sign Mechnic Pte Ltd;Joanna Wan (in person) for creditor, Transvert Scaffold;Thetsunaing (in person) for creditor, Sasco Engineering;Pillai Vik (in person) for creditor, Panacea International;andWileeza A Gapar for the official receiver.", "decorations": [{}, {}, {}, {}, {"italic": [[465, 469], [539, 678], [702, 757]], "bold": [[605, 609], [633, 644]]}, {}, {}, {"italic": [[277, 281]], "blockquote": [[436, 523], [524, 1361], [1362, 1851], [1852, 2102], [2103, 2322], [2323, 2773], [2774, 3532], [3533, 4044], [4045, 4474], [4475, 5045], [5046, 5479], [5480, 6155], [6156, 6809], [6810, 6869]]}, {}, {"italic": [[353, 354]]}, {}, {}, {}, {}, {}, {}, {}, {}, {}, {}, {"italic": [[486, 490]]}, {}, {}, {}, {}, {}, {}, {"italic": [[326, 329]]}, {"italic": [[37, 77], [99, 115], [276, 285]]}, {"italic": [[244, 262], [345, 348]]}, {"italic": [[117, 118], [153, 154]]}, {}, {"italic": [[370, 371]]}, {"italic": [[22, 23], [447, 480], [595, 642], [671, 721]], "blockquote": [[80, 327]]}, {"italic": [[138, 151]]}, {"italic": [[32, 71], [668, 706], [728, 743], [745, 746], [869, 881], [912, 931], [980, 996]], "blockquote": [[120, 618], [760, 932]]}, {}, {}, {}, {}, {"italic": [[292, 299]]}, {}, {}, {}, {"italic": [[716, 720]]}, {}, {"italic": [[481, 512]]}, {}, {}, {}, {}, {}], "dates": "27 March, 24 April, 12 May, 9, 30 June, 7, 21 July, 11 August, 8, 22 September, 6 November, 18 December 2017, 15 January 2018", "tags": ["Companies/Winding up"]}